In [1]:
#GroupBy - group together rows based of off a column and perform an aggregate function on them.
#Choose a column, get the rows and get values from it
#Aggregate function = operations that take a lot of data and turns it into one value (mean, std, etc.)

In [2]:
import numpy as np 
import pandas as pd

In [3]:
data = {'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'], 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'], 'Sales':[200,120,340,124,243,350]}

In [4]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [5]:
df = pd.DataFrame(data)

In [6]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [7]:
#use Groupby method to group rows together based off of a column name
#group by the company
byComp = df.groupby('Company')

In [8]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [9]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [10]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [11]:
#find the sale sums of Facebook 
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [12]:
#do it in one line
#group by company, get the sum of all values in the facebook rows
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [13]:
#count - number of instances in a column
df.groupby('Company').count() #they have 2 employees with 2 sales each

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [14]:
#max and min
df.groupby('Company').max() # this shows names and goes by alphabetical order

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [16]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [17]:
#Use GroupBy with the describe method - a bunch of useful info all at once
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [19]:
#use Transpose if you want each company to be a column instead of an actual index
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [23]:
#call a single company as well
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64